app/views/tickets/_form.html.erb

SELECT "events".* FROM "events"
---
    <%= form.label 'Wydarzenie' %>
    <%= form.collection_select(:event_id, Event.all, :id, :artist) %>

SELECT "users".* FROM "users"
---
    <%= form.label 'Użytkownik' %>
    <%= form.collection_select(:user_id, User.all, :id, :email) %>