app/controllers/events_controller.rb

INSERT INTO "events" ("artist", "description", "price_low", "price_high", "event_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save