app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("name", "seat_id_seq", "address", "price", "email_address", "created_at", "updated_at", "phone", "event_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "address" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["address", "Kraków"], ["updated_at", "2019-01-27 10:52:06.888457"], ["id", 1]]

    def correct_user
      return if current_user.tickets.find_by(id: params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]